{
    "site-title": "Ege Bilecen - Portfolio",

    "title-1": "Hello, I am Ege, and I am a",
    "title-2": "mechatronics engineer",
    "title-3": "I specialize in software development. I have done a variety of work in various fields, such as embedded programming, web development, mobile development, using various programming languages. Because of this, I am quite quick to adapt to new projects and new programming languages.",
    "contact-btn": "Contact",

    "my-works": "My Works",
    "my-works-desc": "",
    "item-all": "All",
    "item-automation": "Automation",
    "item-image-processing": "Image Processing",
    "item-nextion-screen": "Nextion Screen",
    "item-game-mod": "Game Mod",

    "freelance-work-desc": "No source code available for this project as it has been done as freelance work.",
    "personal-work-desc": "No source code available for this project as it has been done for personal purposes.",
    "view-btn": "View",

    "crypto-coin-tracker-title": "Crypto Coin Tracker",
    "crypto-coin-tracker-desc": "In this project, I did write a <b>PHP</b> cronjob script to periodically check a few crypto coin's change percentages and send push notifications to the users via an app called <b>Catapush</b> (using their API) if the percentage change is above or below the specified threshold using <b>CoinMarketCap</b> API.",

    "image-proc-circle-title": "Colored Circle Detecting with Image Processing",
    "image-proc-circle-desc": "This is a wrapper I did write for <b>TEKNOFEST International Unmanned Aerial Vehicles - Drone Category</b> 2020 competition's second task. This wrapper works in two steps. First, a filtering is done using HSV color range of desired color in HSV color space. Then extracting the contour areas and their details such as area position, size, etc. After this; based on distance of contour area center points, their mean values will be calculated and will be combined into single point. This point represents the point of interest that will be cropped from original frame using some arbitrary dimension and will be given into <b>HoughCircles</b> circle detection function of OpenCV as a parameter. The main reason for cropping the point of interest from the original frame using some arbitrary dimension is, applying <b>HoughCircles</b> circle detection method on original frame would be much more slower than just detecting the circles in point of interest. Especially considering original frame is a 1920x1080 frame meanwhile cropped point of interest would be something around 500x500. Then; as second step, detected circle center points in point of interest frame will be combined into one point based on their center points' distance between other circles' center points. Then this single combined center point will be combined with the center point of the combined contour areas into single point. This final point will be the detected cirle's center point.",

    "mesh-network-home-title": "Home Automation with Mesh Network",
    "mesh-network-home-desc": "In this project, a mesh network has been created for published data from several sensors that are placed separately from each other in order to reach the <b>System on Chip</b> system in the house that is acting as a server. These sensor data will then be published to the mobile application that is connected to the server via <b>Websocket</b>. I choosed <b>Raspberry PI 3</b> as <b>SoC</b> because of it's cheap price. <b>painlessMesh</b> library is used for creating the mesh network. <b>NodeMCU</b> IoT platform is used for the nodes in mesh network. Mobile application connects to the server using it's local IP address in WiFi network. Communication between root node and server is done by using <b>ROS</b>. Root node sends all sensor data from child nodes via <b>ROS Serial</b> library. Root node is connected to the server via physical cable. Reason of this is <b>NodeMCU</b> being unable to connect more than one WiFi network. (Meanwhile <b>painlessMesh</b> itself creates an access point, <b>ROS Serial</b> library attempts to connect to an exist WiFi network. This causes these two library to conflict with each other.) Mobile application is developed using <b>Xamarin Forms</b> to be cross-platform application.",
    "mesh-network-home-note": "No source code available for this project as it has been done as assignment in my collage.",

    "car-screen-design-title": "Electrical Car Screen Design and Communication Software",
    "car-screen-design-desc": "My screen design for <b>TEKNOFEST Efficiency Challenge Electrical Vehicle</b> 2021 competetion to satisfy competition rules using <b>Nextion Screen</b> (HMI Solution). I did write the communication between the microcontroller inside the car and screen using <b>C++</b>. Also, serial communication protocol is used through serial port.",
    "car-screen-design-note": "As I am not a UI designer, screen design is quite bad. 😅",

    "home-automation-title": "Home Automation",
    "home-automation-desc": "In this project, I did use <b>NodeMCU</b> IoT platform to connect to the WiFi network of the house, get data from connected sensors (temperature sensor, movement detection sensor etc.) periodically and store them on my database in a hosting using a <b>PHP</b> based API I did write. I did also use <b>C++</b> for the firmware of <b>NodeMCU</b>. In addition, I used <b>Cordova</b> to create a mobile webview application for <b>Android</b> using <b>HTML</b>, <b>CSS</b> and <b>Javascript</b>. All of the sensor data can be tracked in this application. This application also allows user to extensively update settings of all components. Such as updating sensor status (activated / deactivated), changing their polling rates and even adding sleep time (this can be useful to prevent notification spam for sensors like movement detection sensor as <b>NodeMCU</b> sends notification to the application every time sensor is triggered).",
    "home-automation-note": "Application pictures are under the \"<b>home_controller_app</b>\" directory of GitHub repo.",

    "pz-server-discord-bot-title": "Discord Bot for Project Zomboid Server Management",
    "pz-server-discord-bot-desc": "A discord bot I have written for managing <b>Project Zomboid</b> server console remotely through discord using <b>C#</b> and <b>Discord.NET</b> library. Also, this bot adds more functionality to the server that normally aren't available such as automated server restarts every 6 hours, mod update detections, auto start in case of server dying, etc.",

    "nwn-portrait-program-title": "Portrait Generation Application",
    "nwn-portrait-program-desc": "A program I have written for <b>Neverwinter Nights</b> game to automatically generate portraits from selected portrait (image) that matches with the game's portrait size rules. I did use <b>C#</b> and <b>Windows Forms</b> for this application. It also features cropping based on portrait size (This game has four different portrait sizes).",

    "2d-drone-simulation-title": "2D Drone Swarm Simulation",
    "2d-drone-simulation-desc": "In this project, I did use <b>HTML</b>, <b>CSS</b> and <b>Javascript</b> to simulate swarm movement. At the time being, only 3 formations are available: Line, V and Circle. The algorithm for preventing drone to drone collisions aren't implemented yet.",
    "2d-drone-simulation-note": "<b>Note for Demo:</b><br /> You can enable swarm movement by clicking to the most top right button. It is disabled as default for test purposes.",

    "bill-generator-title": "Bill Generator",
    "bill-generator-desc": "In this project, one can create a bill using the records stored in an excel file and drag-n-drop their headings to the spots they want to fill with the record on selected bill's picture. When the bill creation is done, all the records in the excel file will be placed on heading's dragged location and will be automatically printed out. I did use <b>C#</b> and <b>Windows Forms</b> for this application.",

    "woz-title": "Browser Based 2D Multiplayer Game",
    "woz-desc": "In this 2D browser based multiplayer game project, I did use <b>HTML</b>, <b>CSS</b> and <b>Javascript</b> for the client side and <b>NodeJS</b> for the server side. Communication between client and server done using websockets. I did use <b>Socket.IO</b> library for this. Also character data stored on a <b>MongoDB</b> database.",

    "arelith-portal-tracker-desc": "A <b>PHP</b> and <b>MySQL</b> based statistics panel for tracking a game's user activity. To track the user activity, I did write a <b>PHP</b> cronjob script that runs every 15 minutes to save the activity into database.",

    "business-management-panel-title": "Business Management Panel",
    "business-management-panel-desc": "A <b>PHP</b> and <b>MySQL</b> based management panel for a business' requirements.",

    "google-maps-bot-title": "Google Maps Data Scraper",
    "google-maps-bot-desc": "An application developed for saving business details in cities using address and keyword list into excel using <b>C#</b> and <b>Windows Forms</b>. Data mining is done with using <b>Selenium</b>.",

    "data-scraper-bot-title": "Product Data Scraper",
    "data-scraper-bot-desc": "An application developed for saving products listed under product categories into excel using <b>Python</b> and <b>PyQT</b>.",

    "sahibinden-product-bot-1-title": "Sahibinden.com Data Scraper",
    "sahibinden-product-bot-1-desc": "An application developed for saving products listed under product categories from sahibinden.com into excel using <b>Python</b> and <b>PyQT</b>. Data mining is done with using <b>Selenium</b>. It also changes the IP using proxy in specified intervals.",

    "sahibinden-product-bot-2-title": "Sahibinden.com Data Scraper 2",
    "sahibinden-product-bot-2-desc": "An application developed for saving products listed under product categories from sahibinden.com into excel using <b>Python</b> and <b>PyQT</b>. Data mining is done with using <b>Selenium</b>.",

    "sahibinden-product-bot-3-title": "Sahibinden.com Data Scraper 3",
    "sahibinden-product-bot-3-desc": "An application developed for saving products listed under product categories from sahibinden.com into excel using <b>Python</b> and <b>PyQT</b>. Data mining is done with using <b>Selenium</b>.",

    "sahibinden-ad-bot-title": "Sahibinden.com Auto Product Advertiser",
    "sahibinden-ad-bot-desc": "An application developed for automatically advertising the product details that is set in the application interface on sahibinden.com using <b>Python</b> and <b>PyQT</b>. Automation is done with using <b>Selenium</b>.",

    "kariyer-net-bot-title": "Kariyer.net Data Scraper",
    "kariyer-net-bot-desc": "An application developed for saving advertisement details from kariyer.net into excel using <b>Python</b> and <b>PyQT</b>.",

    "bulurum-com-bot-title": "Bulurum.com Data Scraper",
    "bulurum-com-bot-desc": "An application developed for saving search results from bulurum.com into excel using <b>Python</b> and <b>PyQT</b>.",

    "twitch-chat-bot-title": "Twitch Chat Bot",
    "twitch-chat-bot-desc": "An application developed for sending messages from a pre-prepared account list to a twitch channel's chat using <b>Python</b> and <b>PyQT</b>.",

    "fb-like-bot-title": "Facebook Like Bot",
    "fb-like-bot-desc": "An application developed for liking replies sent to a facebook post using <b>Python</b> and <b>PyQT</b>. Automation is done with using <b>Selenium</b>.",

    "grocery-expense-tracker-title": "Grocery Expense Tracker",
    "grocery-expense-tracker-desc": "An application developed using <b>C#</b> and <b>Windows Forms</b> for tracking daily grocery expenses.",

    "last-epoch-desc": "An application developed for <b>Last Epoch</b> game using <b>C#</b> and <b>Windows Forms</b>. It exports the save data located in registry and imports the save data using exported registry data.",
    "js-code-executor-desc": "An extension I have written for <b>Google Chrome</b> using <b>HTML</b>, <b>CSS</b> and <b>Javascript</b>. Purpose of this extension is to execute arbitrary code when specific events occur on specific elements.",

    "english-japanese-translate-title": "English / Japanese Translate",
    "english-japanese-translate-desc": "An extension I have written for <b>Google Chrome</b> using <b>HTML</b>, <b>CSS</b> and <b>Javascript</b>. Purpose of this extension is to easily get the translation of a japanese word by just selecting it. One can also perform a word search by clicking to the extension icon and writing the japanese word they want to search. Then the results will be listed below.",

    "close-open-tabs-title": "Close All Open Tabs",
    "close-open-tabs-desc": "An extension I have written for <b>Google Chrome</b> using <b>Javascript</b>. Purpose of this extension is to close all the open tabs when user clicks to the extension icon for the first time and when clicked for the second time, restore the all closed tabs.",

    "manga-app-title": "Manga Reading Application",
    "manga-app-desc": "A manga reading app developed for <b>Android</b> using <b>Cordova</b>. For user requests, I wrote a <b>PHP</b> based API. And to automate the manga updates, I did write several <b>PHP</b> cronjob scripts.",

    "finger-the-balloons-desc": "A game application developed for <b>Android</b> using <b>Cordova</b>. My main purpose for developing this application was to observe the performance of <b>HTML5 canvas</b> in a <b>webview application</b> and touch point detection accuracy.",
    "websocket-python-server-desc": "<b>Python</b> server library for the <b>RFC6455 Websocket Protocol</b>.",
    "project-zomboid-mod-desc": "A mod I created using <b>Lua</b> for <b>Project Zomboid</b> game.",

    "license-generator-title": "License Generator",
    "license-generator-desc": "An application developed using <b>Tauri</b> and <b>React</b> for generating valid license files for my own applications with <b>Rust</b> programming language."
}
