{
    "site-title": "Ege Bilecen - Portfolyo",
    "title-1": "Merhaba, ben Ege Bilecen ve ben",
    "title-2": "mekatronik mühendisiyim",
    "title-3": "Ben yazılım alanında uzmanlaştım. Birden fazla birbirinden farklı alanlarda ve programlama dillerinde çalışmalar gerçekleştirdim. Bu yüzden farklı projelere ve farklı programlama dillerine adapte olma sürecim oldukça hızlı.",
    "my-works": "Çalışmalarım",
    "my-works-desc": "",
    "item-all": "Tümü",
    "item-ros": "ROS",
    "item-automation": "Otomasyon",
    "item-image-processing": "Görüntü İşleme",
    "item-game-mod": "Oyun Modu",
    "image-proc-circle-title": "Görüntü İşleme ile Renkli Daire Tespiti",
    "image-proc-circle-desc": "2020 yılında düzenlenen <strong>TEKNOFEST Uluslar Arası İnsansız Hava Aracı Yarışması</strong>nın 2. görevine yönelik yazmış olduğum görüntü işleme wrapperıdır. Bu wrapper iki ayrı işlem yapmaktadır. Öncelikle HSV renk uzayında yer alan renk aralığına göre bir filtreleme işlemi yaparak istenilen renge uygun olan alanın filtrelenip contour tespiti ile özelliklerinin (konumu, alanı vs.) çıkartılması gerçekleştirilmiştir. Daha sonra bulunan contour merkezlerinin birbirlerine olan uzaklığına bağlı olarak ortalama değerleri alınıp tek bir nokta olacak şekilde birleştirilmiştirler. Bu işlemden sonra birleştirilmiş olan noktanın bulunduğu bölüm (point of interest) orjinal frame üzerinden belirli bir boyutta kesilerek OpenCV'de yer alan <strong>HoughCircles</strong> daire tespit etme metodu uygulanmıştır. Orjinal frame üzerinden belirli bir alan kesilip bunun üzerinde daire tespit metodu uygulanmasının asıl sebebi bütün bir frame üzerinde daire tespitinin yapılması yavaş bir işlem olmasından dolayı bunun yerine tespit ettiğimiz renkli alanın bulunduğu kısımda arama yapılmasının çok daha hızlı olmasıdır. Daha sonra bu point of interest üzerindeki daire merkezleri de birbirlerine uzaklık seviyelerine göre birleştirilip tek bir nokta haline getirilmiştir. Bu nokta ile de tek bir noktada birleştirilmiş contour merkezleri de filtrelenip tek bir nokta haline getirilerek tespit edilmek istenilen renkli dairenin merkez noktası tespit edilmiş olunur.",
    "mesh-network-home-title": "Mesh Network ile Ev Otomasyonu",
    "mesh-network-home-desc": "Bu projede bir ev otomasyonu için mesh network kurulup sensörlerden gelen verilerin ev içerisinde konumlandırılan <strong>System on Chip</strong> sistemin server olarak çalışması ile bir mobil uygulama üzerinde yayınlanması (gösterilmesi) gerçekleştirilmiştir. <strong>SoC</strong> olarak düşük maaliyetinden dolayı <strong>Raspberry PI 3</strong> tercih edilmiştir. Mesh networkü oluşturmak için <strong>painlessMesh</strong> kütüphanesi kullanılmıştır ve kontrolcü kartları olarak <strong>NodeMCU</strong> tercih edilmiştir. Mobil uygulama servere serverin local WiFi ağındaki IP adresi ile bağlanmaktadır. Server ile root node arasındaki haberleşme <strong>ROS</strong> kullanılarak yapılmaktadır. Root node bütün diğer nodelardan gelen sensör verilerini <strong>ROS Serial</strong> kütüphanesi ile servere göndermektedir. Root node servere serial kablosu ile bağlıdır. Bunun sebebi <strong>NodeMCU</strong>'nun birden fazla WiFi ağına bağlanamamasıdır. (<strong>painlessMesh</strong> kendisi bir access point oluştururken <strong>ROS Serial</strong> varolan bir ağa bağlanmaya çalışmaktadır. Bu da iki kütüphanenin birbirleri ile çatışmasına sebep olmaktadır.) Mobil uygulama <strong>Xamarin Forms</strong> kullanılarak cross-platform olacak şekilde geliştirilmiştir.",
    "mesh-network-home-note": "Mekatronik Tasarım Uygulamaları dersi için yapıldığından kaynak kodu bulunmamaktadır.",
    "home-automation-title": "Ev Otomasyonu",
    "home-automation-desc": "Bu projede <strong>NodeMCU</strong> kontrolcü kartının üzerine bağlanılan sensörlerden alınan verilerin (sıcaklık sensörü, hareket sensörü vb.) evin <strong>WiFi ağına</strong> bağlanılıp, <strong>PHP</strong> tabanlı bir API'ye istek gönderilerek hostingde yer alan veritabanına belirli aralıklarla sensör verilerinin kayıt edilmesi gerçekleştirilmiştir. Ayrıca bu veriler <strong>Cordova</strong> kullanılarak <strong>Android</strong> için geliştirdiğim bir uygulama ile takip edilebilmekte. Bu uygulama üzerinden veri güncelleme aralığı, sensörlerin aktif/pasif durum ayarları dahi yapılabilmekte.",
    "home-automation-note": "Uygulama görselleri GitHub reposundaki \"<strong>home_controller_app</strong>\" klasörü altındadır.",
    "license-generator-title": "Lisans Oluşturucu",
    "license-generator-desc": "Bu projede <strong>Tauri</strong> ve <strong>React</strong> kullanılarak geliştirilmiş bir arayüzün <strong>Rust</strong> programlama dili aracılığı ile kendi programlarım için geçerli olan lisans dosyaları oluşturma işlemi gerçekleştirilmiştir.",
    "personal-work-desc": "Kişisel amaçlar için yapıldığından dolayı kaynak kodu bulunmamaktadır.",
    "pz-server-discord-bot-title": "Project Zomboid Server Yönetimi için Discord Botu",
    "pz-server-discord-bot-desc": "<strong>Project Zomboid</strong> oyununun serverini discord üzerinden yönetmek için geliştirilmiş bir <strong>C#</strong> uygulamasıdır. <strong>Discord.NET</strong> kütüphanesini kullanmaktadır. Project Zomboid server konsoluna el ile komutlar girilebilmektedir. Fakat bu bot sayesinde bota komutlar gönderilerek server yönetimi gerçekleştirilebilmektedir. Bu bot ile ek olarak Project Zomboid serverinde yer almayan (her 6 saatte bir otomatik yeniden başlatma vb.) özellikler de bulunmaktadır.",
    "crypto-coin-tracker-title": "Kripto Para Takibi",
    "crypto-coin-tracker-desc": "<strong>PHP</strong> kullanılarak yazılmış bir cronjob scripti ile belirli aralıklarla <strong>CoinMarketCap</strong>'in API'si kullanılarak istenilen kripto paraların değişimini takip edip, belirlenen eşik değerinin üzerinde veya altında bir değişim varsa <strong>Catapush</strong> adlı uygulama üzerinden (API'lerini kullanarak) kullanıcılara push notification gönderen bir proje.",
    "nwn-portrait-program-title": "Portre Oluşturma Uygulaması",
    "nwn-portrait-program-desc": "<strong>Neverwinter Nights</strong> oyunu için geliştirilmiş bir portre düzenleyicisidir. <strong>C#</strong> ile <strong>Windows Forms</strong> kullanılarak hazırlanmıştır. Kullanıcının seçmiş olduğu resim (portre) dosyasını otomatik olarak oyunun kabul ettiği boyutlara getirmektedir. Ayrıca kullanıcıya portrenin bir kısımını da kesme imkanı sunmaktadır.",
    "2d-drone-simulation-title": "2D Drone Sürü Simülasyonu",
    "2d-drone-simulation-desc": "Bu projede <strong>HTML, CSS ve Javascript</strong> kullanılarak basit bir sürü hareket simülasyonu geliştirilmiştir. Şu anda çizgi, V ve daire olmak üzere 3 formasyon bulunmaktadır. Droneların hareket ederken birbirlerine çarpmaması için yol bulma algoritması henüz entegre edilmemiştir.",
    "2d-drone-simulation-note": "<strong>Demo Notu:</strong><br> En sağ üstte yer alan butona basarak sürü hareketini aktif edebilirsiniz. Bazı test sebeplerinden dolayı hareket varsayılan olarak devre dışı.",
    "bill-generator-title": "Fatura Oluşturucu",
    "bill-generator-desc": "Bu projede bir excel dosyasında yer alan kayıtların başlıklarının sürekle bırak yoluya seçilen görselin üzerine yerleştirilip bir fatura oluşturulması gerçekleştirilmiştir. Fatura oluşturma işlemi bitirildiği zaman bütün veriler sırası ile seçilen görsel üzerine yerleştirilip otomatik çıktı işlemi yapılmaktadır. <strong>C#</strong> ile <strong>Windows Forms</strong> kullanılarak hazırlanmıştır.",
    "freelance-work-desc": "Freelance bir iş olarak yapıldığı için kaynak kodu bulunmamaktadır.",
    "woz-title": "Browser Tabanlı 2D Multiplayer Oyun",
    "woz-desc": "Bu projede client tarafında <strong>HTML, CSS ve Javascript</strong>, server kısımında ise <strong>NodeJS ve Socket.IO</strong> kullanılarak browser tabanlı 2D bir multiplayer oyun yapılmıştır. Kullanıcı verilerini saklamak için <strong>MongoDB</strong> kullanılmıştır.",
    "arelith-portal-tracker-desc": "Bu projede bir oyunun web sayfasında yer alan kullanıcıların bilgileri hosting üzerinde her 15 dakikada bir çalışan cronjob sayesinde veritabanına kayıt edilerek bir PHP paneli aracılığı ile kullanıcılara sunulmuştur.",
    "business-management-panel-title": "Yönetim Paneli",
    "business-management-panel-desc": "Bu projede bir firmanın ihtiyacına yönelik <strong>PHP ve MySQL</strong> kullanılarak bir yönetim paneli geliştirilmiştir.",
    "grocery-expense-tracker-title": "Harcama Takip Uygulaması",
    "grocery-expense-tracker-desc": "Günlük harcamaları takip etmek için geliştirilmiş bir uygulamadır. <strong>C#</strong> ile <strong>Windows Forms</strong> kullanılarak hazırlanmıştır.",
    "last-epoch-desc": "<strong>Last Epoch</strong> oyunu için geliştirilmiş bir uygulamadır. <strong>C#</strong> ile <strong>Windows Forms</strong> kullanılarak hazırlanmıştır. Registry'de yer alan save bilgilerini dışarı aktarır veya dışarı aktarılan registry bilgisinden içeri aktarım yapar.",
    "js-code-executor-desc": "Bu proje <strong>Google Chrome</strong>'a eklenti olacak şekilde <strong>HTML</strong>, <strong>CSS</strong> ve <strong>Javascript</strong> kullanılarak yazılmıştır. Bu eklentinin amacı istenilen sayfada yer alan bir element üzerinde gerçekleşen spesifik bir eventte kendi istediğimiz <strong>Javascript</strong> kodlarını çalıştırmasıdır.",
    "english-japanese-translate-title": "İngilizce / Japonca Çeviri",
    "english-japanese-translate-desc": "Bu proje <strong>Google Chrome</strong>'a eklenti olacak şekilde <strong>HTML</strong>, <strong>CSS</strong> ve <strong>Javascript</strong> kullanılarak yazılmıştır. Bu eklentinin amacı istenilen sayfada herhangi bir Japonca kelimenin taranılarak eklenti sayesinde İngilizce karşılığının kolayca gösterilmesini sağlamaktır. Ayrıca browserın eklenti barından da direk İngilizce bir kelime aranıp bulunan Japonca kelime sonuçları listelenmektedir.",
    "view-btn": "Görüntüle",
    "manga-app-title": "Çizgi Roman Okuma Uygulaması",
    "manga-app-desc": "<strong>Cordova</strong> kullanılarak <strong>Android</strong> için geliştirilmiş bir manga (çizgi roman) okuma uygulamasıdır. <strong>PHP</strong> ile kullanıcı istekleri için API yazılmış olup otomatik olarak çizgi romanları güncelleyecek bazı cronjob scriptleri de bulunmaktadır.",
    "finger-the-balloons-desc": "<strong>Cordova</strong> kullanılarak <strong>Android</strong> için geliştirilmiş bir oyun uygulamasıdır. Bu uygulamayı geliştirmemdeki temel amacım <strong>HTML5 canvas</strong>ının bir <strong>webview uygulaması</strong>nda ne kadar performanslı ve hassas (dokunma işlemi için) çalıştığını görmekti.",
    "websocket-python-server-desc": "<strong>RFC6455 Websocket Protokolü</strong> için <strong>Python</strong> ile yazmış olduğum bir server kütüphanesidir.",
    "project-zomboid-mod-desc": "<strong>Project Zomboid</strong> oyunu için <strong>Lua</strong> ile geliştirmiş olduğum bir moddur.",
    "are-combat-sim-title": "Arelith Savaş Simülatörü",
    "are-combat-sim-desc": "Bu projede, <b>Dungeons & Dragons</b> masaüstü oyununu temel alan Neverwinter Nights oyunu için bir savaş simülatörü oluşturdum. <b>Arelith</b>, temel oyunun üzerine yeni mekanikler ekleyen bir rol yapma sunucusu ve bu simülatör de bu yeni mekanikleri esas almakta. Proje, <b>Tauri</b> frameworkünü kullanarak bir masaüstü programı oluşturuyor. Ek olarak, kullanıcı arayüzü için <b>React</b> ve <b>Ant Design</b> UI bileşenlerini kullanıyor. Etkileşimli grafikleri oluşturmak içinse <b>ECharts</b> kütüphanesini kullanıyor."
}
